[German]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Bitte verbinden Sie zum Koppeln den 2,4-GHz-USB-Dongle des Geräts mit dem USB-Anschluss Ihres Computers.
Please follow the steps below for pairing. = Führen Sie bitte die folgenden Schritte zum Koppeln aus.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Legen Sie den Schalter für die Verbindung auf RF 2,4 GHz Modus fest.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Halten Sie die linke Taste, rechte Taste und DPI-Taste drei Sekunden lang gedrückt.
3. Click the "Pair" button on the interface. = 3. Klicken Sie in der Benutzeroberfläche auf die Schaltfläche „Koppeln".	
1. Connect the device to your computer with the USB cable. = 1. Verbinden Sie das Gerät mithilfe des USB-Kabels mit Ihrem Computer.
2. Click the "Pair" button on the interface. = 2. Klicken Sie in der Benutzeroberfläche auf die Schaltfläche „Koppeln".

Pair = Koppeln
Close = Schließen
Pairing = Wird gekoppelt...
Pairing completed = Die Kopplung ist abgeschlossen.
Pairing failed = Die Kopplung ist fehlgeschlagen.

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Schließen Sie das Gerät mithilfe eines USB-Kabels an Ihren Computer an und legen Sie den Schalter für die Verbindung auf den RF 2,4 GHz-Modus fest.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Halten Sie die Funktionstaste 15 Sekunden lang gedrückt, bis Sie akustische Bedienerhinweise hören.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Trennen Sie bitte den RF 2,4-GHz-Empfänger und stecken Sie ihn dann wieder ein. Schalten Sie das Gerät aus, und schalten Sie das Gerät dann in den RF 2,4-GHz-Modus.